app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 21]]
---
  def index
    @users = User.all
    @tasks = Task.all.includes(:user)