app/views/tasks/index.html.erb

    <td>
      <i class="fas fa-tag"><%= task.tags.map(&:label).join(', ') %></i>
---
SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."task_id" = $1  [["task_id", 1]]