app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.user_id = current_user.id
    #追加
    tag_list = params[:task][:name].split(',')
    if @task.save
      #追加
      @task.save_tag(tag_list)
---
INSERT INTO "tasks" ("name", "content", "created_at", "updated_at", "deadline", "condition", "priority", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "post_tags" ("task_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["task_id", 1], ["tag_id", 1], ["created_at", "2022-01-13 23:14:30.323342"], ["updated_at", "2022-01-13 23:14:30.323342"]]
INSERT INTO "tags" ("label", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["label", "breakfast"], ["created_at", "2022-01-13 23:14:30.301166"], ["updated_at", "2022-01-13 23:14:30.301166"]]

  def index
    @tasks = Task.page(params[:page]).per(7)
    @tag_list = Tag.all
    if params[:sort_expired]
      @task = current_user.tasks.order(deadline: :desc).page(params[:page]).per(7)
    elsif params[:sort_priority]
      @task = current_user.tasks.order(priority: :asc).page(params[:page]).per(7)
    elsif params[:name].present?
      if params[:condition].present?
        @task = current_user.tasks.task_name_search(params[:name]).condition_search(params[:condition]).page(params[:page]).per(7)
---
SELECT COUNT(*) FROM "tasks"
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."condition" DESC LIMIT $2 OFFSET $3  [["user_id", 9], ["LIMIT", 7], ["OFFSET", 0]]

  def update
    @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def search_tag
    @tag_list = Tag.all
    @tag = Tag.find(params[:tag_id])
    @tasks = @tag.tasks.page(params[:page]).per(7)
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" INNER JOIN "post_tags" ON "tasks"."id" = "post_tags"."task_id" WHERE "post_tags"."tag_id" = $1 LIMIT $2 OFFSET $3  [["tag_id", 62], ["LIMIT", 7], ["OFFSET", 0]]